DataProcessors/ЛБ_НастройкаРазмеровДрагоценныхКамней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЛБ_НастройкаРазмеровДрагоценныхКамней</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДрагоценныеВставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидКамня</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеКамни</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаОгранки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ФормыОгранки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОгранки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ВидыОгранки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Размеры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_РазмерыДрагоценныхКамней</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидКамня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеКамни</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ФормыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_РазмерыДрагоценныхКамней</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЛБ_НастройкаРазмеровДрагоценныхКамней/Forms/ФормаДобавить/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ВидКамня") тогда 
		ВидКамня = Параметры.ВидКамня;
	КонецЕсли;
	Если Параметры.Свойство("ФормаОгранки") тогда 
		ФормаОгранки = Параметры.ФормаОгранки;
	КонецЕсли;	
    Если Параметры.Свойство("ВидОгранки") тогда 
		ВидОгранки = Параметры.ВидОгранки;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция Проверить()
	Запрос = новый Запрос; 
	Запрос.УстановитьПараметр("ВидКамня", ВидКамня);
	Запрос.УстановитьПараметр("ФормаОгранки", ФормаОгранки);
	Запрос.УстановитьПараметр("ВидОгранки", ВидОгранки);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.ВидКамня КАК ВидКамня,
	               |	ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.ФормаОгранки КАК ФормаОгранки,
	               |	ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.ВидОгранки КАК ВидОгранки
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней КАК ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней
	               |ГДЕ
	               |	ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.ВидКамня = &ВидКамня
	               |	И ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.ФормаОгранки = &ФормаОгранки
	               |	И ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.ВидОгранки = &ВидОгранки";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции	
	
&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	Если НЕ Проверить() тогда
		Сообщить("Запись с такими измерения уже существует в регистре настройки размеров драгоценных камней!");
		Возврат;
	КонецЕсли;
	
	СтруктураВ = Новый структура;
	СтруктураВ.Вставить("ВидКамня", ВидКамня);
	СтруктураВ.Вставить("ФормаОгранки", ФормаОгранки);
	СтруктураВ.Вставить("ВидОгранки", ВидОгранки);
	ЭтаФорма.Закрыть(СтруктураВ);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры
